[{"timestamp": "Tue Mar 13 09:36:54 -0700 2007", "uri": "http://vemod.net/", "author": "Christoffer Sawicki", "content": "\u003Cp\u003EHey Phil!\u003C/p\u003E\n\n\n\t\u003Cp\u003EJust for the record, I suppose this is what XP calls \u0026#8220;Add a Customer to the Team\u0026#8221; and \u0026#8220;Release Regularly\u0026#8221;. (Yeah, I looked it up in Extreme Programming Pocket Guide by chromatic \u0026#8211; a book I can gladly recommend.)\u003C/p\u003E"},{"timestamp": "Tue Apr 03 10:15:56 -0700 2007", "uri": "", "author": "Matt Scilipoti", "content": "\u003Cp\u003EThanks for a clear, concise description of why small discrete steps are great for you.  This may help convince teams I consult with to at least attempt it before they discount it.\u003C/p\u003E\n\n\n\t\u003Cp\u003EYour method of documenting the story looks effective.  It\u0026#8217;s refreshing to see someone creating a solution that is appropriate for their needs vs. \u0026#8220;but, the book says we should\u0026#8230;\u0026#8221;. You can easily add diagrams and \u003Cspan class=\"caps\"\u003EGUI\u003C/span\u003E \u0026#8220;wire frames\u0026#8221;.  I can\u0026#8217;t wait until I find something as simple as pen and paper that works effectively with a team (i.e. supports collaboration, separate locations, is searchable, easy to review/accept updates).\u003C/p\u003E\n\n\n\t\u003Cp\u003EAnd most importantly\u0026#8230; thanks for sharing.\u003C/p\u003E"},{"timestamp": "Tue Jul 17 12:26:36 -0700 2007", "uri": "http://www.fabianbartsch.net", "author": "Fabian Bartsch", "content": "Good evening Phil!\r\u003Cbr /\u003E\n\r\u003Cbr /\u003E\nIt was very interesting for me to read your article, because i nearly have the same 'close-customer-contact' as you had, on my last project. We have meetings every two weeks, and so the customer was very closely involved in the developing-process. What i have learned is, that its very difficult to find out, what the customer and our team had appointed eg. four weeks ago, if both are not documenting the meeting-points and agreements very exactly. so, one thing we had tried is to record the meeting with a dictaphone, so that the whole team can listen everytime to what was discussed at the meetings. another thing what i think is, if the customer is involved that closely, you save more time in the developing-process, because things can be corrected fast enough, so that you not have to make big changes at the end of the project. Thanks again for showing another approach to that topic :)\r\u003Cbr /\u003E\n\r\u003Cbr /\u003E\nBest regards,\r\u003Cbr /\u003E\nFabian"}]
