[{"timestamp":  "Mon Dec 10 20: 23: 39 -0800 2007",  "uri":  "http: //42squared.com",  "author":  "hornbeck",  "content":  "Phil, \r\u003Cbr /\u003E\n\r\u003Cbr /\u003E\nI wanted you to know that I took your code and built it on rubinius and started adding to it.  If you would like me to share what I have or if you have any objections please let me know.  I am hornbeck on irc and am normally in #rubinius,  #merb,  #caboose"}, {"timestamp":  "Sun Dec 09 09: 25: 27 -0800 2007",  "uri":  "http: //brainspl.at",  "author":  "Ezra",  "content":  "That is definitely cool. I'm going to be playing with this. I think it would be fun to implement a scheme that emits rubinius bytecodes and runs on the rubinius vm."}, {"timestamp":  "Sun Dec 09 07: 59: 42 -0800 2007",  "uri":  "http: //scie.nti.st",  "author":  "Garry",  "content":  "That's pretty cool.  You can host it at git.caboo.se.  Contact me (up_the_irons) in #caboose if you want to go this route."}, {"timestamp":  "Sun Dec 09 08: 03: 07 -0800 2007",  "uri":  "",  "author":  "Garry",  "content":  "Oh,  I see you already have a repo there,  good : )  Nice Arthur C. Clarke quote above the circuit boards BTW,  it's my favorite."}, {"timestamp":  "Wed Dec 12 22: 00: 41 -0800 2007",  "uri":  "http: //focus.tracinglight.com/",  "author":  "Daniel Peckham",  "content":  "Hey Phil...I just watched your RubyConf talk.  Great job!  Good material,  and good presentation.  The concepts were interesting and helpful,  even though I'm not doing as much coding right now."}, {"timestamp":  "Mon Dec 10 17: 22: 53 -0800 2007",  "uri":  "http: //technomancy.us",  "author":  "Phil",  "content":  "Garry:  I might do that. What I meant there is that I'd like to be able to host my own repositories,  but that may just be infeasible with my current hosting solution.\r\u003Cbr /\u003E\n\r\u003Cbr /\u003E\nEzra:  What a coincidence; you just hired someone who knows a lot about Ruby and has implemented Scheme like five times. I'm sure he could cook up something more appropriate; this is really just a toy for me. Though if you find it useful/fun that's great."}]
