{"timestamp": "2008-05-04 13:11:41", "title": "in which some claims are admitted to have been left unfulfilled and an explanation is given", "id": 110, "content": "

<p>So late last year I envisioned some grand plans to work on Elisp
for Rails. I was going to drop work on <a
href='http://rinari.rubyforge.org'>Rinari</a> and merge what I had
with <a href='http://dima-exe.ru/rails-on-emacs'>rails.el</a> as well
as a whole bunch of other stuff. Soon after, I was put on a project at
work that was almost 100% Javascript, (oh, and my son was born) so I
didn't have much of a chance to put these ideas into action. But I'm
back on the Rails track these days, and the general state of things is
encouraging. First of all, <a
href='http://ourcomments.org/Emacs/nXhtml/doc/nxhtml.html'>nxhtml</a>
is very impressive. It manages to get all the nasty Ruby-inside-HTML
problems fairly decently solved[<a href='#fn-109'>1</a>], which is
more than I could say of rhtml-mode, my own attempt.</p>

<p>I've been meaning to pull out my fork of rails.el to dust it off
and integrate it back into my daily habits. But looking over the
feature list, there's just not much there that I would find helpful
for my daily use. It feels like overkill. The only snippet expansion I
use is to insert <tt>&lt;%= %&gt;</tt>, but I've already got that
bound in nxhtml-mode. Integration with script/* and rake is
uninteresting to me since I already keep my shell usage with in Emacs
via Eshell, (which I hope to post about later; it's quite
underappreciated) so the difference between M-x and a shell command is
trivial. SVN integration is not a big deal for me because Emacs'
built-in VC integrates well with Git already.</p>

<p>Most of the interesting stuff to me boils down to a few things that
don't necessarily demand their own mode:</p>

<dl>
  <dt>Template editing</dt>
  <dd>I've already mentioned nxhtml-mode above, which does a
  remarkable job at highlighting and indentation of Rails views.</dd>

  <dt>Quick navigation</dt>

  <dd>This is really the low-hanging fruit. Project navigation is one
  of those things that can be sped up dramatically with the right kind
  of help. Very little of this is actually rails-specific; mostly it's
  just a matter of knowing what files belong as part of the app. The
  other day I took a stab at refactoring the
  <tt>find-file-in-project</tt> library to use the unix <tt>find</tt>
  command.</dd>

  <dt>Integrated documentation lookup</dt>
  <dd>In one sense <tt>ri</tt> is indispensable.
  </dd>

  <dt>Test runners</dt>
  <dd>Sometimes you just know better than autotest.</dd>

  <dt>Console buffer</dt>

<p>[<a name='fn-109'>1</a>] - If you're having trouble with font-lock
  disappearing in regular ruby files after opening up an ERB buffer, try installing
  <a
      href='http://svn.ruby-lang.org/cgi-bin/viewvc.cgi/trunk/misc/ruby-mode.el?view=log'>the
  latest ruby-mode from SVN</a>&mdash; I've submitted a patch to fix
  that behaviour.</p>


", "tags": ""}
