{"timestamp": "Sat Oct 13 00: 00: 01 -0700 2007", "title": "dual booting", "id": 43, "content": "<p>No,  I haven't gone over to the dark side. I just happened to start\n    using two operating systems on my machine--GNU\/Linux and GNU\n    Emacs. Now that I've switched to <a\n    href='http: \/\/my.gnus.org'>Gnus<\/a> for mailing,  I basically spend\n    all my time in Emacs and the browser. Sure,  I've got the\n    occasional xterm up when I don't feel like using eshell (mostly\n    for ssh),  but in general it suffices.<\/p> \n<img src='\/static\/i\/dust.jpg' alt='dusty CPU' align='right' \/>\n<p>Anyway,  I still don't\n    feel like I've grokked Gnus very well yet,  so I still keep\n    Evolution open. But even if I don't end up liking Gnus a ton,  I'd\n    rather have a great editor and a poor mailer than a great mailer\n    and a terrible editor. Gnus is kind of... different.<\/p> <p>The\n    other awesomeness I've recently discovered is <a\n    href='http: \/\/conkeror.mozdev.org'>Conkeror<\/a>: <\/p>\n    <blockquote>Conkeror is a mozilla based web browser designed to be\n    completely keyboard driven,  no compromises. It also strives to\n    behave as much like Emacs as possible. This means all the\n    keybindings and to-die-for features of Emacs that can be imitated\n    by a javascript\/XUL web browser Just Work.<\/blockquote> <p>It's an\n    extension for Firefox that recognizes that using the keyboard for\n    everything is a much more efficient way to do things. I quote, \n    \"You should never have to reach for your mouse. To make sure\n    Conkeror remains pure,  I do not own a mouse.\" That's something I\n    can really admire! I'm still on the fence about switching from\n    Epiphany,  but it's really intriguing. What I'd really like is\n    <tt>gecko-mode<\/tt> for Emacs,  but I understand that the rendering\n    engine is pretty primitive.<\/p>\n    <p>Oh yeah,  and here's a photo of my desktop's heatsink. Compressed\n    air is your friend.<\/p>"}
