{"timestamp": "Sat Oct 13 00: 00: 01 -0700 2007", "title": "dustin brushes his teeth with lasers and combs his hair with the future", "id": 45, "content": "  \t   <p>So I was reading <a href='http: \/\/planet.lisp.org'>Planet\n\t   Lisp<\/a> the other day,  and I came across <a\n\t   href='http: \/\/lemonodor.com\/archives\/001382.html'>Lemonodor's\n\t   post on Startup School<\/a>. In it he mentions how attendees\n\t   were able to keep notes via <a\n\t   href='http: \/\/www.codingmonkeys.de\/subethaedit\/'>SubEthaEdit<\/a>.\n\t   <\/p>\n\t   \n\t   <p>Now,  I had a rather mixed response to this. The\n\t   pragmatist in me thought,  \"Oh,  cool; they were able to take\n\t   more comprehensive notes on the event with this neat piece\n\t   of collaborative software.\" The idealist in me thought, \n\t   \"Wait,  this is bad; it increases reliance on software that\n\t   is not only closed,  but is developed by people who <a\n\t   href='http: \/\/crschmidt.livejournal.com\/259345.html'>totally\n\t   disregard<\/a> users' freedom to interoperate.\" Finally,  the\n\t   pragmatist in me came around,  \"Oh crap,  if <b>I<\/b> were\n\t   there,  I wouldn't have been able to take part in this. No good!\"<\/p>\n\t   \n\t   <p>So,  with the help of the excellent <a\n\t   href='http: \/\/darcs.0x539.de\/trac\/obby\/cgi-bin\/trac.cgi\/wiki\/ObbyProtocol'>Obby\n\t   protocol<\/a>,  the dynamic power of Emacs Lisp,  and some\n\t   spare hacking time in the past three days,  I've come up\n\t   with <a\n\t   href='http: \/\/dev.technomancy.us\/phil\/wiki\/ebby'>Ebby<\/a>,  a\n\t   library that allows Emacs to collaboratively edit documents\n\t   in a synchronized way. It doesn't have a shiny icon,  but I\n\t   hope you give it a shot.<\/p>\n\t   \n\t   <p>Note that Ebby only runs as a client; you'll have to get\n\t   <a href='http: \/\/darcs.0x539.de\/'>Gobby<\/a> to run as a\n\t   server to connect to. Ebby connects to Gobby version 0.3, \n\t   which seems to be the latest stable version at the time of\n\t   this writing. If you can't install Gobby,  (or just don't\n\t   feel like it) you can try connecting to my server at\n\t   technomancy.us,  but there's no guarantee that it will be\n\t   running at all times.<\/p>\n\t   \n\t   <p>So please try it out and add your comments to\n\t   <a href='http: \/\/dev.technomancy.us\/phil\/wiki\/ebby'>the\n\t   wiki<\/a>. Don't be shy about <a\n\t   href='http: \/\/dev.technomancy.us\/phil\/newticket'>filing\n\t   tickets for any problems or patches you may have<\/a>.<\/p>\n\t   \n\t   <p><b>Update<\/b>:  critical bug fixed; please <a href='http: \/\/dev.technomancy.us\/phil\/browser\/dotfiles\/.emacs.d\/ebby.el'>grab a fresh copy<\/a>!<\/p>"}
