{"timestamp":"Sat Oct 13 00:00:01 -0700 2007","title":"metalicious","id":46,"content":"<blockquote>From a safe distance Mickos will ask such questions as\n\"How do you plan your day?\"<br\/> \n<br\/> \nIf a reply comes back that says \"I always sleep until 11 A.M., and\nthen I start working,\" Mickos doesn't want to hear any more. He's\nsold. \"The brightest engineers like the calmness and coolness of the\nnight,\" he says.  <\/blockquote>\n\n<p>-<a\nhref='http:\/\/money.cnn.com\/2006\/05\/31\/magazines\/fortune\/mysql_greatteams_fortune\/index.htm'>Marten\nMickos<\/a> on MySQL's interviewing and hiring practices<\/p>\n\n<p>Funny story: when I was in eighth grade, I was a crack QBasic\nprogrammer. I was about as good as you can get at writing QBasic code,\nwhich says a lot about QBasic and not much about my own skill\nlevel. I'd written a few games, and I decided I wanted to make\nsomething that would allow others to make text adventure games. My\nprogram would ask questions and output the text adventure as runnable\nQBasic code. Thus began my first foray into metaprogramming and\nperhaps the most foolish coding project I would ever attempt. (Though\nmy program could output games just fine, it had a difficult time\nloading them back in and editing them.)<\/p>\n\n<p>Speaking of metaprogramming, I had a stimulating conversation with\na philosopher yesterday about <a\nhref='http:\/\/en.wikipedia.org\/wiki\/Symbolic_logic'>symbolic logic<\/a>\nthat turned towards Lisp and AI. Symbolic logic attempts to describe\nknowledge by use of a specific dialect. (I'm sure I'm oversimplifying,\nbut this seems to be the aspect which most relates to what I\nunderstand.)  My discovery of the night was that Lisp is particularly\nsuited to AI because it's very good at metaprogramming because\nmetaprogramming is almost the same thing as learning. (I sense this\nstatement needs to be backed up, but I'm not sure how.) The problem\nwith writing AI is that it goes beyond metaprogramming--an AI system\nmust metaprogram itself, and thus writing an AI system would be\nmeta-meta-programming.<\/p>"}
