{"timestamp":"Sat Oct 13 00:00:01 -0700 2007","title":"18 hours of rails + 6 hours of sleep = 24 hours of awesome","id":47,"content":"<p>So, <a href=\"http:\/\/www.railsday2006.com\/\">Railsday<\/a> just\n  ended a few hours ago, and I thought I'd give a run-down here.<\/p>\n\n<p>I got to team up with <a href=\"http:\/\/evil.che.lu\">Cristi Balan<\/a>\n    and <a href=\"http:\/\/www.lorem-ipsum.at\/\">Ferdinand Svehla<\/a>,\n    from Romania and Austria, respectively. I had originally intended\n    to go with a local team, but the three of us worked out really\n    well as a team--evilchelu's Javascript hacks were very impressive,\n    and fullmoon's troubleshooting saved us a lot of time. The huge\n    timezone differences made things awkward in certain parts of the\n    day, but both my teammates surprised me with their incredible\n    capacity for staying up far longer than is healthy.<\/p>\n\n<img src='\/static\/i\/railsday.png' alt='checkin graph' title='code stats' \/>\n\n<p>In case you're not familiar,\n  the <a href=\"http:\/\/www.railsday2006.com\/pages\/rules\">concept of\n  Railsday<\/a> is that you gather a team together of up to three\n  people, and you build a web application in 24 hours using Ruby on\n  Rails. Today was the second ever Rails Day, and there were a huge\n  number of participants.<\/p>\n\n<p>The project that we built is called Concourse. Here's an excerpt\n  from the readme:<\/p>\n\n<blockquote>\n  OK, so you've got this meeting, right? A bunch of people\n  have to come to this meeting, but you don't know when they are going\n  to be available. So what you do is sign on to Concourse and create a\n  new meeting. You give provide some details and a list of folks you'd\n  like to attend. When you're done, each person gets an email asking\n  them to please enter their availability for the meeting.<\/blockquote>\n\n<blockquote>\n  Each person can then log in with the URL provided in the email to\n  specify the times they can make it to the meeting. In theory, when\n  everyone had entered their times, the organizer would then be asked to\n  decide upon a time, and his decision would be informed by what\n  everyone had said.<\/blockquote>\n\n<img src='\/static\/i\/concourse.png' alt='concourse screenshot'\n     title='shiny' \/>\n\n<p>Unfortunately we came very close to finishing, but didn't quite get\n  in the last feature. The organizer can see all the times people have\n  specified for the meeting, but he cannot decide on one of them and\n  have the attendees notified. Even though it was a bit disappointing\n  to not be able to finish, it was great fun to participate, and we\n  all got some great experience.<\/p>\n\n<p>There's a development version running\n  at <a href=\"http:\/\/technomancy.us:3000\">http:\/\/technomancy.us:3000<\/a>, \n  though I hope to find a <a href=\"http:\/\/concour.se\">better place<\/a> for\n  it soon. We do plan on finishing what we started, as this could\n  potentially be a rather useful service.<\/p>\n\n<p>Lastly, check\n  out <a href=\"http:\/\/www.flickr.com\/photos\/tags\/railsday\/\">all these\n  Railsday photos<\/a>!<\/p>\n"}
