{"timestamp": "Sat Oct 13 00: 00: 01 -0700 2007", "title": "after railsday", "id": 48, "content": "<p>OK,  Concourse has gotten significantly better in the past few\ndays. If there were a Railsday prize for\nmost-improved-project-since-Railsday,  we would definitely be one of\nthe top contenders. The time-choosing code could use some heavy\nrefactoring,  and it doesn't quite send emails at all the right times\nyet,  but it'll probably be functional before RailsConf ends at the\nlatest. You can reach the subversion code repository at\n<tt>http: \/\/phil.hagelb.org\/concourse<\/tt>.<\/p>\n\n<p>To really qualify as Web-2.0 you need a snappy domain name,  so I\nregistered <tt>concour.se<\/tt> from <a\nhref='http: \/\/loopia.se'>Loopia.se<\/a> with the help of a good web\ntranslator and <a href='http: \/\/jw.fi'>unfo-<\/a> from #caboose.<\/p>\n\n<p>One of the most interesting things about the development was that\nthe data model stayed rather stable almost the whole time. We only had\none migration,  and that was to change the data types from datetime to\ndate. But then in the last half hour we had a huge change in how we\nstored things.<\/p>\n\n<p>There is an attendances field that records a user's attendance to a\nmeeting. It has a serialized field called 'times' that was originally\nmeant to store a custom data type I would code called a Noncontinuous\nRange. (Ranges in Ruby are good for storing time ranges,  but we needed\nto be able to have multiple non-overlapping ranges in a single day and\nperform set operations (the intersect of Quentin's range and Arthur's\nrange,  for example) that I wanted to code into this class.)<\/p>\n\n<p>In the last half hour of the contest we came to the conclusion that\nstoring an array of hours would be a lot easier to interface with the\nJavascript,  since it would just return time information structured\nthat way. Surprisingly enough,  I was able to make that change with\ntime to spare,  even though it was such a core part of our\napplication. I think this is really a testament to the merits of a\nstrong test suite than anything else--we had a 1: 0.8 code-to-test\nratio.<\/p>\n\n<p>Anyway,  I hope you'll try Concourse out. It won't solve your\nproblems quite yet until I can configure ActionMailer on DreamHost, \nbut hopefully it will be useful very soon.<\/p>\n\n<p>Tomorrow I'll be getting on the plane to Chicago for RailsConf. It\nshould be very interesting; I'll post thoughts and photos.<\/p>"}
