{"timestamp": "Sat Oct 13 00: 00: 01 -0700 2007", "title": "i really need to find some of that obedience lacquer", "id": 49, "content": "<p>The first day of Railsconf just flew by,  and it's been quite a\nblast. The highlight of the day was the triple-event combo of Martin\nFowler,  Paul Graham,  and Why the Lucky Stiff. Paul Graham talked about\nthe benefits of being an \"outsider\"--you can get away with a whole lot\nmore than if you were part of the established order of things. He\nincluded his usual jabs at business-as-usual,  and was really\nthought-provoking and funny. I expect you'll see the essay uploaded in\na week or so; read it when you do.<\/p>\n\n<p>Of course,  you can read all about the events at <a\nhref=\"http: \/\/hagelb.org\/railsconf\">Planet Railsconf<\/a>--there is a\nwhole horde of railsers blogging the events here. However,  I can't\nsign off tonight without mentioning the fantastic performance of Why\nand the Thirsty Cups.<\/p>\n\n<p>Their set was a real treat--we got a load of songs,  some wild hacks\n(including one that stumped the inimitable DHH),  and new installments\nof\n  <i>The Least Surprised<\/i> and <i>Everyone is Here in the\n  Future<\/i>. I was quite glad to see that the latter seems to be a\n  serial--I'm looking forward to the next episodes. I haven't gotten a\n  chance to check it out much,  but _why\n  unveiled <a href=\"http: \/\/balloon.hobix.com\">Balloon<\/a> during his\n  talk,  which seems to be a way of getting your Ruby out to the masses\n  quickly and painlessly.<\/p>\n\n<p>After the concert I got to head over to talk to _why. He signed my\n  \"chunky bacon\" t-shirt,  and he got a bunch of present folks\n  (including myself as well as a member of the hotel janitorial staff)\n  to sign a t-shirt of his own,  so it was a fair trade. Afterwards I\n  saw the Thirsty Cups just hanging looking bored,  so I went over to\n  talk with them,  and I got my shirt signed by the whole band. (I'm\n  sure this shirt is now capable of bestowing amazing ruby powers on\n  the wearer,  and I'm quite excited to see how that works out.)\n  Apparently the Cups are not quite into programming and the like,  but\n  they enjoy getting on the road with _why (Trudy is his wife) and\n  love his hijinks,  even if the code is a bit beyond them. (Though\n  let's admit it,  when it comes to _why's code,  it's usually beyond a\n  great many of us!) They seem like a really great crew,  and I hope I\n  can see them perform at another event in the future. (My hopes are\n  high; after\n  all,  <a\n  href=\"http: \/\/redhanded.hobix.com\/cult\/everyoneIsHereInTheFuture.html\">everyone\n  is here,  in the future<\/a>.)<\/p>\n\n<p>All in all,  a marvelous day. I will do my best to keep my readers\n  informed here,  but don't skip <a href=\"http: \/\/hagelb.org\/railsconf\">\n  Planet Railsconf<\/a> as there's much more than I could write\n  available there. Also see\n  the <a href=\"http: \/\/flickr.com\/photos\/tags\/railsconf\/\">Railsconf tag\n  on Flickr<\/a>.<\/p> \n"}
