{"timestamp": "Sat Oct 13 00: 00: 01 -0700 2007", "title": "sixth rubyconf recap", "id": 64, "content": "<p>Just finished up RubyConf yesterday; it was most excellent. There\n  were tons of quality talks,  and of course it's always fun to let\n  yourself go and totally geek out. Last year I had Planet RubyConf\n  set up,  but this year I got a late start and wasn't able to gather\n  enough feeds to really do anything\n  interesting. Luckily <a\n  href=\"http: //blog.nicksieger.com/articles/tag/rubyconf2006\">Nick\n  Sieger</a> was able to liveblog with astonishing prolificicity,  and\n  the horde in #rubyconf\n  was <a href=\"http: //ni.hili.st/posts/pages/16\">tumblelogging</a>\n  like they were infected with a tumbleness disorder. Much fun and\n  good-natured heckling was to be had. (Tip:  don't be That Guy.)</p>\n\n<img src=\"/static/i/rubyconf06.png\" alt=\"rubyconf\n     06 Denver logo\" align=\"right\"/>\n\n<p><a\n  href=\"http: //arko.net/2006/6/26/rails-core-q-amp-a-session\">Obligatory</a>\n  out-of-context quotes that attendees will have a jolly belly-laugh\n  at and everyone else will scratch their heads reading: </p>\n\n<ul>\n  <li>Fact:  One time this programmer posted profiling data without\n  noting his standard deviation,  and Zed Shaw vaporized him from\n  across the room.</li>\n  <li>\"We tell the computer to do something and it does it. We tell\n  people to do something,  and they don't. That's why we like computers\n    better than people.\" -- Forrest Chang</li>\n  <li>Fact:  Zed Shaw's code profiles itself.</li>\n  <li>\"Take us to mongrel factor 9. But Sir,  Zed said that we do not\n  need 9 mongrels!\" -- Adam Keyes</li>\n  <li>Fact:  Zed Shaw is so awesome that he uses Chad Fowler as a\n    remote control.</li>\n  <li>\"One of the more exciting things about Vista is its security is\n    really good.\" -- XAMLchick</li>\n  <li>Fact:  Zed Shaw runs his production apps out of irb.</li>\n  <li>\"Myths:  YARV finds your girlfriend.\" -- SASADA Koichi</li>\n  <li>Fact:  Zed Shaw writes code using every single one of those\n    250, 000 [unicode] characters.</li>\n  <li>\"Hello Joe.\" \"Hello Mike.\"</li>\n  <li>Fact:  Zed Shaw rfuzzed your girlfriend.</li>\n</ul>\n\n<p>(The next time Zed is looking for a job his interviewers are going\n  to have a blast poking around on Google. I think it'll improve his\n  chances though; most teams would be improved by adding someone who\n  can refactor living organisms.)</p>\n\n<p>A good portion of my time was spent pondering and discussing how to\n  improve Emacs support for Ruby and Rails. I've been hacking a lot of\n  that in my spare time,  and I'm pretty confident saying rhtml support\n  has been much improved for it. We've also been talking a lot about\n  Smalltalk-style refactoring support,  which will be a titanic\n  task. Fortunately it looks\n  like <a href=\"http: //soc.jayunit.net/\">some folks</a> have put some\n  work in to hacking that for Eclipse. (I know... I know! Hopefully it\n  can be extracted and generalized.)</p>\n\n<p>I got to brush shoulders with all sorts of top-notch fellow hackers\n  and even got a conversation in with the\n  venerable <a href=\"http: //www.rubyist.net/~matz/\">Matz</a> and the\n  controversial <a href=\"http: //tbray.org/ongoing\">Tim\n  Bray</a>.&lt;/fanboi&gt; Mostly we talked about those refactoring\n  ideas,  and Tim mentioned that leveraging tests would be a good way\n  to get typing data about your code provided you've got good\n  coverage. There's tons to be done,  but I'm excited to see how this\n  progresses.</p>\n\n<p><a href=\"http: //www.flickr.com/photos/technomancy/tags/rubyconf2006/\">Photos</a> up when I get home to my F-spot.</p>\n"}
