{"timestamp":"Sat Oct 13 00:00:01 -0700 2007","DRAFT":null,"title":"js invasion","id":68,"content":"<p>\"Firefox is a great operating system, I just wish it had a decent\n  web browser.\"<\/p>\n\n<p>If you've been programming long enough you've probably heard the\n  Emacs version of that joke. (If you've used Emacs enough, you\n  probably know that it's not actually a joke.) Like Emacs, Firefox\n  isn't really an application; it's a dynamic development platform\n  disguised as an application. I suppose shouldn't be a huge\n  revelation to me since people have been building apps like\n  Thunderbird or Sunbird on the Mozilla platform for ages. Folks have\n  even been putting together\n  some <a href=\"http:\/\/songbirdnest.com\">crazier<\/a>\n  <a href=\"http:\/\/flock.com\">apps<\/a> in XUL. But Firefox was always\n  a big monolithic app written in a non-dynamic language to me.<\/p>\n\n<p>Anyway, the cause of my most recent epiphany\n  is <a href=\"http:\/\/dev.hyperstruct.net\/mozlab\/wiki\">Mozlab<\/a>. It's\n  a Firefox plugin that gives you access to a\n  killer <a href=\"http:\/\/en.wikipedia.org\/wiki\/REPL\">REPL<\/a> \n  for interacting with a live Mozilla session. There's\n  a <a href=\"http:\/\/dev.hyperstruct.net\/movie\/mozrepl.html\">neat lil'\n  flash screencast<\/a> that explains its usefulness better than I can\n  here. The Emacs integration is also top-notch--if you've\n  used <a href=\"http:\/\/common-lisp.net\/project\/slime\/\">SLIME<\/a> for\n  doing Common Lisp development, this is basically the same thing for\n  XUL. You connect to a running instance of Firefox and can send it\n  bits of Javascript that you are working on to evaluate.<\/p>\n\n<p>All this to say: the flexibility that Mozilla gives you (when\n  coupled with the tools of MozLab) is well suited for ridiculous\n  amounts of customization using Javascript alone. It really is a\n  platform on which you can build apps that just happen to have access\n  to one of the best rendering engines written. I've often\n  <a href=\"http:\/\/technomancy.us\/blog\/post\/44\">lamented about the lack\n  of a solid browser written in one of my favorite languages<\/a>. At\n  one point I thought the answer might be to try to get bindings to\n  the Gecko rendering engine in Ruby or Lisp, but this involves more C\n  than I can handle. The real answer here is that Firefox is written\n  in Javascript, not C, and Javascript is dynamic enough to be\n  suitable for an application-building framework like Emacs.<\/a>\n\n<p>Oh, and one more thing. In GNU\/Linux, setting the environment\n  variable <tt>MOZ_DISABLE_PANGO=1<\/tt> before launching Mozilla will\n  get you a serious speed boost at the expense of accurate rendering\n  of some non-latin characters. (I haven't seen any problems yet.)\n  This made Firefox just as fast as Epiphany for me, which was the my\n  last objection to switching.<\/p>\n"}
