{"timestamp":"Sat Oct 13 00:00:01 -0700 2007","DRAFT":null,"title":"vannevar","id":74,"content":"<p>So I finally replaced\nmy <a href=\"http:\/\/philisha.net\/articles\/2005\/01\/20\/high-living\">aging\nlaptop<\/a> with something a bit more up-to-date: a Core 2 Duo Thinkpad\nT60p. I'm really happy with it; it's definitely got that <i>solid<\/i>\nfeeling to it for which Thinkpads are famous. I'm pretty sure it's the\nmost sturdily-constructed laptop I've used. Even the Trackpoint device\nis a pleasure to use. If you've hated Trackpoints on other laptops,\nthe Thinkpad version is much more comfortable, and being able to move\nthe pointer without leaving the home row is a big usability win.<\/p>\n\n<p>The only disappointment I've noticed so far is the graphics card;\nit's an ATI FireGL V5250 for which no Free drivers are available. If I\nhad known I'd have to use the binary fglrx drivers, I would have gotten\nanother configuration&mdash;the ATI drivers are kind of lame compared\nto the Free drivers that work for other cards. They work better for 3D\neffects, but they don't work with AIGLX\nand <a href=\"http:\/\/beryl-project.org\">Beryl<\/a>, which is the only 3D\nstuff I would actually be marginally interested in using. I've also\nheard that the binary driver can cause major issues with hibernation,\nbut I haven't really tried that much; suspend seems to be fine. In a\nperfect world the jokers at ATI would just step aside and let the real\nhackers write the drivers, but what can you do. Next time I'm getting\nan Intel card if at all possible.<\/p>\n\n<img src=\"\/static\/i\/t60p.png\" alt=\"thinkpad t60p\"\ntitle=\"vannevar\" style=\"border: 0\" align=\"left\" \/>\n\n<p>The resolution (1600x1200) is ridiculously sharp, which is the main\nreason I chose the Thinkpad over the similarly-priced Macbook Pro. It\nhas 2.3 times as many pixels as my last laptop. It's also got a\nnifty <a href=\"http:\/\/thinkfinger.sf.net\">fingerprint reader<\/a> that\nyou can plug into <acronym title=\"Pluggable Authentication\nModules\">PAM<\/acronym> and use to authorize yourself with any regular\nUnixy programs. Pretty cool. I was a bit worried about the extra\nweight, (~2.5 kg vs the 1.5 of my old Dell) but it turns out I don't\ntote it around nearly as much as I used to when I got my Dell, being\nin university at the time, so the weight doesn't bother me.<\/p>\n\n<p>The other issue is that the folks at Adobe don't have a Flash\nplayer that works on 64-bit Linux systems, so I can't watch YouTube. I\nwas already on the edge about whether I should bother with installing\nFlash on this machine, so this made that decision easier. All in all\nI'd consider not having Flash a blessing in disguise, and it's not\neven a very convincing disguise. Maybe once <a href=\"http:\/\/www.gnu.org\/software\/gnash\/\">Gnash<\/a> gets more polished\nthings will change. (Or if Adobe gets a clue, but I'm not holding my\nbreath.)<\/p>\n\n<p>I decided to go ahead and try out Ubuntu \"Fiesty Fawn\" 7.04. It's a\nbit rough around the edges as it always is with prereleases that are\nstill a few months away from primetime, but it's definitely stable and\nusable enough for my daily work. All the hardware was detected fine\nwith the exception of the video card&mdash;since it's nonfree it\nrequired an extra step to get working&mdash;and the fingerprint\nreader, for which I had to compile the driver manually. (This was very\neasy to do.) By default it uses the vesa video drivers which work for\ndisplay but are quite slow. I'm going to hold off on <tt>apt-get\nupgrade<\/tt>ing frequently just because that can be a recipe for\ndisaster when you've got a lot of work to do. For my own use I\nkept <a\nhref=\"http:\/\/dev.technomancy.us\/phil\/wiki\/UbuntuInstallation\">notes on\nthe installation process<\/a> so I remember all the steps in the\nfuture; perhaps that would come in handy for others.<\/p>\n\n<p>The real news is that this frees up my old laptop for\na <a href=\"http:\/\/dev.technomancy.us\/phil\/wiki\/NorbertRobot\">career in\nrobotics<\/a>. Once I get a chance to research UARTs and pick up the proper\nchips, I should be able to get that project rolling again.<\/p>\n"}
