{"timestamp":"Sat Oct 13 00:00:01 -0700 2007","title":"five things meme","id":75,"content":"<p>Oh noes&mdash;I've\n  been <a\n  href=\"http:\/\/metaatem.net\/2007\/02\/12\/5-thingz-u-didnt-no-bout-me\">hit<\/a>. The\n  inimitable Erik Kastner smacked me with an obligation to reveal five\n  \"little-known\" facts about myself. Normally I don't comply with this\n  sort of thing, but Kastner's a good fellow... I didn't want to let\n  him down. It may be a bit duller than his, but keep in mind this\n  wasn't my idea.\n<\/p>\n\n<ol>\n  <li>I was caught in a flash flood hiking in a ravine in the\n  mountains of Indonesia. We had just finished climbing (tumbling?\n  scampering? There's a word for it...) about the boulders at the\n  ravine's head and started for home when we were pursued by a\n  torrent of muddy water.<\/li>\n  <li>I got drafted into the basketball team in high school because of\n  my height. I didn't stand a chance; it was decided behind my back\n  from the very day I visited the school as a prospective student. I\n  later found out that a few students stood up for me: \"What if he\n  doesn't want to be a basketball player? What if he wants to be a\n  chef?\" It didn't help, but it did earn me the nickname \"The Chef\"\n  for a brief while. I was terrible at basketball.<\/li>\n  <li>I witnessed an attempted attack on\n  the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Western_wall\">Western\n  Wall<\/a> in Jerusalem. I was above the plaza looking out at the city\n  and saw someone make a break from the checkpoint to the crowds at\n  the wall. He didn't looked armed, but he had a bag with him. He was\n  apprehended before he got 5m away from the security checkpoint.<\/li>\n  <li>I got my start in programming on QBasic for DOS in 7th grade. I\n  wrote a couple cool games, but I thought I should move on to\n  something more serious and started learning C and CodeWarrior. I\n  always thought the sheer amount of additional effort necessary to\n  get something decent working in a GUI environment turned me off\n  programming until university, but now I'm thinking it had more to do\n  with people. I had a few friends who enjoyed QBasic, and I had\n  nobody to work with on C stuff. It didn't help that I thought \"real\"\n  programming had to be GUI-related and a huge pain, and that only\n  \"kids' stuff\" was easy and fun.<\/li>\n  <li>I've dislocated both my shoulders multiple times.  You can make\n  me quiver in discomfort by merely talking about shoulders the\n  various joint-related problems which can happen to them. Please\n  don't.<\/li>\n<\/ol>\n\n<p>I suppose the traditional thing to do here is pass on the meme to others:<\/p>\n<ul>\n  <li><a href=\"http:\/\/www.emacswiki.org\/cgi-bin\/wiki\/ErBot\">fsbot<\/a><\/li>\n  <li><a\n  href=\"http:\/\/www.emacswiki.org\/cgi-bin\/wiki\/BirnyTheBot\">birny<\/a><\/li>\n  <li>corundum<\/li>\n<\/ul>\n\n<p>Unfortunately they haven't gotten back to me on that.<\/p>\n"}
