{"timestamp":"Sat Oct 13 00:00:01 -0700 2007","title":"project management","id":77,"content":"  <p>My most recent Rails project has been fairly interesting to me\n  because it's the most structured of any project I've ever\n  done. Every week there's a conference call between the development\n  team and the clients in which we demo all the work that we've done\n  in the past week, bring any questions of direction or specifics\n  before the client, and discuss what area the next week's development\n  should cover. There's probably a fancy agile name for this\n  methodology, but we kind of just go with what works for us.<\/p>\n\n  <p>This has had a number of unexpected benefits. For one thing, it\n  brings a good level of focus. When you commit to taking a feature\n  for the next week, you need to think about exactly what that entails\n  and how much you can take on in that time. You have to know your\n  limits. It encourages you to build features in small increments\n  since you have to go all the way from database migrations to UI and\n  HTML views (and occasionally even Javascript enhancements, although\n  that can usually wait) all in a single week. I found this to be very\n  helpful both in terms of helping me focus on the task at hand and in\n  terms of thinking about the feature itself. When there isn't much\n  time between the initial discussion of a feature and the writing of\n  its UI, it's easier to consider its impact upon the users. If your\n  initial idea had some flaws, they can be discovered much more quickly\n  than they would otherwise be.<\/p>\n\n  <img src=\"\/static\/i\/demo1.jpg\" alt=\"demo sheet\" \/>\n\n  <p>Every week since I thought of it I've written out everything that\n  the week's demo will cover. I've found it's helpful to write out\n  exactly the steps you're going to take to demonstrate the new\n  functionality. Any small questions that can wait for the demo are\n  noted in the margins, as is a list of initial plans for what you\n  will take next week. It's also great to have paper in front of you\n  during the call so if there's a small fix you need to do you can\n  just jot it in the margins.<\/p>\n\n  <img src=\"\/static\/i\/demo2.jpg\" alt=\"demo sheet\" \/>\n\n  <p>I've found myself to be more or less terrible at time estimating\n  in the past, but the structured nature of this project means I'm\n  constantly thinking about how long things have taken in previous\n  iterations and how I should consider future features in the light of\n  this. I've never had such a small feedback loop before, so I think\n  this experience will go along way towards improving my estimating\n  skills in the future. Being able to go back over the demo sheets also\n  gives me a concrete record of what was done in each iteration, which\n  is a handy reference.<\/p>\n\n  <p>Thinking in small discrete steps is great.<\/p>\n"}
