{"timestamp":"Sat Oct 13 00:00:01 -0700 2007","title":"waiting to board","id":79,"content":"<p>Somehow I'm getting a wifi signal in LAX, so I'll be able to remedy\r\n  the fact that I wasn't able to get a post in before I took off. As I\r\n  <a href='http:\/\/philisha.net\/2007\/03\/big-news\/'>mentioned on my\r\n  other blog<\/a>, Alisha and I are heading off to Indonesia for a\r\n  month. I'll be doing training and setup with GNU\/Linux, Ruby, and\r\n  other Free Software at a small software development shop in Central Java.<\/p>\r\n\r\n<p>Before I left I had a bit more Javascript fun. My brother-in-law\r\n  <a href='http:\/\/www.birdsofyore.com'>Loren Broach<\/a> came up with a\r\n  game that I coded up. You\r\n  can <a href='http:\/\/technomancy.us\/static\/code\/monolith\/index.html'>play it\r\n  in your browser<\/a> if you want. I haven't done game programming in\r\n  a while; that was a lot of fun. I haven't done GUI programming in a\r\n  while; that aspect was only fun because it was so simple. The cool\r\n  thing about it is that first I wrote it the way I normally write\r\n  Javascript, which is fairly procedural (and accordingly, somewhat\r\n  brain-dead). I got it working, but then I rewrote it using\r\n  Javascript's object-oriented prototype system. It was a fairly\r\n  interesting exercise. I don't think anyone would defend procedural\r\n  JS as a good way to write nontrivial software, but I've only used it\r\n  for fairly easy stuff in the past barring my few patches to\r\n  Conkeror. This project really opened my eyes to see how you can use\r\n  Javascript in a way that can scale in terms of readability and\r\n  maintainability beyond the couple-page uses that I've had for it so\r\n  far. I'm still on the fence as to whether I prefer Javascript's\r\n  style of OO to the more conventional model. It really feels like\r\n  you're just tossing around eigenclasses the whole time, which takes\r\n  some getting used to. It also resembles the OO system that Paul\r\n  Graham implements in one of the appendices of his <i>ANSI Common\r\n  Lisp<\/i> book. Anyway, it's always fun to play with a new way of\r\n  thinking.<\/p>\r\n\r\n<p>We <a href='http:\/\/philisha.net\/2007\/04\/staging\/'>cleared out our\r\n  apartment<\/a> before we left, so my server had to be moved to\r\n  Alisha's parents' house. A 311-day uptime isn't too unusual these\r\n  days (especially with a UPS), but I was disappointed to start from\r\n  scratch again. Unfortunately Alisha's parents' ISP is pulling some\r\n  dirty moves and blocking all the interesting ports, so I've had to\r\n  move everything I can over to my account\r\n  on <a href='http:\/\/dreamhost.com'>Dreamhost<\/a> in the mean time. I\r\n  haven't been able to get Trac moved over; according to the Dreamhost\r\n  wiki it's a fairly complex task. That means\r\n  the <a href='http:\/\/dev.technomancy.us:8080\/conkeror'>Conkeror\r\n  Trac<\/a> is only available on port 8080... sorry guys! I'll try to\r\n  remedy that when I get the chance.<\/p>\r\n\r\n<p>And finally, I owe <a href='http:\/\/blog.zenspider.com'>Ryan\r\n    Davis<\/a> some <a\r\n    href='http:\/\/blog.zenspider.com\/archives\/2007\/04\/released_toggleel_v_12_and_autotestel_10_beta_2.html'>code<\/a>. I'm\r\n    charging my battery right now so I can hopefully get to writing it\r\n    on the flight. I expect I'll be too beat when I arrive to get it\r\n    posted promptly, but I'm a man of my word&mdash;it'll be uploaded\r\n    eventually.<\/p>\r\n"}
