{"timestamp":"Sat Oct 13 00:00:01 -0700 2007","title":"trans-hemispherical","id":80,"content":"<p>Well, Alisha and I\n  have <a href='http:\/\/philisha.net\/2007\/03\/big-news\/'>been in\n    Indonesia<\/a> now for two weeks. We are really enjoying it; see\n  <a href='http:\/\/philisha.net'>the other blog<\/a> for details.<\/p>\n\n<img src='\/static\/i\/waterfall.jpg' alt='waterfall' title='a hike we took'\n     align='right' \/>\n\n<p>My task here has been training the team here and setting up the\n  necessary technical infrastructure. First off was\n  installing <a href='http:\/\/releases.ubuntu.com'>Feisty Fawn<\/a>\n  (which was serendipitiously released this last Thursday) on a server\n  and configuring basic services on that. Previously they have been a\n  Microsoft-heavy shop with a bit of PHP, but they are very eager to\n  migrate away from that towards a more flexible, cost-effective\n  platform. The best part about this is that not only does it save a\n  lot of money, it also sets the programmers up to be contributors to\n  the global software community rather than simply being\n  consumers.<\/p>\n\n<p>So in addition to the install-fest side of things, I've done some\n  presentations to get the developers up to speed on important\n  topics. The first was a \"beginning Rails\" brief introduction. It's\n  not enough to really get a start coding, but it was enough to whet\n  the appetite and make them wish they didn't have to finish up their\n  projects in PHP. Enthusiasm is great.<\/p>\n\n<p>The other presentation is an overview of how to use Trac and\n  Subversion to collaborate on projects. It's kind of hard to\n  introduce something as fundamental as version control to people\n  unfamiliar with it since it's so easy to take things like that for\n  granted and hard to approach it from a fresh perspective. Still,\n  getting those habits in place is very important.<\/p>\n\n<p>I've uploaded <a href='\/code\/presentations.tar.gz'>the code for the\n  presentations<\/a>. There's not really enough in the slides alone to\n  learn from; they rely heavily on a narrator. Still, they could come\n  in handy to someone else in a similar position. Presenting to a\n  group is tricky; there are a lot of factors to take into\n  account. It's important to know your audience level and find ways to\n  keep them engaged. (I wish I had used more images in the Trac\n  presentation.)  It's been a lot of fun, and I've learned a lot about\n  how to do this kind of thing, though I'm looking forward to getting\n  into more of the day-to-day coding rather than all this high-level\n  stuff.<\/p>\n"}
