{"timestamp": "Sat Oct 13 00: 00: 01 -0700 2007", "title": "turtle power", "id": 81, "content": "<p><a href='http: \/\/myconfplan.com\/conferences\/RailsConf2007'>Railsconf<\/a>\n  is a go. The first day is just wrapping up,  and I've finally got\n  some downtime. First impressions:  Portland is a great place for a\n  conference. There's green everywhere,  and being within the free ride\n  zone for the transit system is quite handy. Having\n  <a href='http: \/\/www.powells.com\/technicalbooks'>Powell's Technical\n  Books<\/a> around is an &uuml;bergeek joy. To top it off,  there's\n  municipal wireless that would be easily up for the task of handling\n  a tech crowd of the size of any previous Ruby-related\n  conference. Unfortunately,  we've got more than twice as many\n  attendees here than any previous conference,  so that part of the\n  equation isn't holding up quite so well.<\/p>\n\n<p>Speaking of... the crowd. It really is quite a sight. If you\n  thought last year's RailsConf was big,  that seems like a warm-up in\n  comparison. I've heard estimates from 1200 to 1600&mdash;It's\n  staggering. In some sense,  it's a coming-of-age for Rails; this is\n  approaching OSCON in size. But it's also a reminder that the heady\n  days of <a href='\/8'>RubyConf 05<\/a> are long gone. It's an\n  unavoidable side-effect of success,  but losing the tightly-knit\n  erudite community that so felt cutting-edge and pioneering is a\n  shame. But it's probably worth it as the price of having more\n  people share in the fun.<\/p>\n\n<img src='\/static\/i\/avi.jpg' alt='avi bryant' title='turtles and web heresies' \/>\n\n<p>Tonight's keynotes were\n  from <a href='http: \/\/smallthought.com\/avi\/'>Avi Bryant<\/a>\n  and <a href='http: \/\/zefrank.com'>Ze Frank<\/a>. Ze had an immensely\n  fun talk about how audiences contribute and how the Web is\n  accelerating that kind of thing. He's funny as the dickens,  but it\n  turns out he's got a sharp technical mind. Avi's talk was probably\n  the most thought-provoking thing I've heard in a while. He talked\n  about how there's no reason Ruby can't be\n  totally <a href='http: \/\/en.wikipedia.org\/wiki\/Self-hosting'>self-hosting<\/a>.\n  Having core classes like Array and Hash implemented in C is\n  currently necessary from a performance point of view,  but it causes\n  annoyances when you want to peek behind the curtain.<\/p>\n\n<p>Avi agreed that for Rails web applications,  performance is usually\n  not directly very important&mdash;if you've got enough users to feel\n  performance pains,  you're likely to have enough money to deal with\n  it. (If you don't,  I imagine the problems with your revenue plan are\n  likely to be more pressing than your technical problems.) The thing\n  is,  performance <i>indirectly<\/i> affects your app in a huge way:  it\n  limits\n  the <a href='http: \/\/blog.caboo.se\/articles\/2007\/4\/8\/heresy-and-turtles-all-the-way-down-with-avi-bryant'>Turtle\n  Factor<\/a>.<\/p>\n<img src='\/static\/i\/turtles1.png' alt='low turtle factor' align='left' \/>\n       \n<p>\"Turtles all the way down\" refers to how much of the language is\n  accessible from within the language itself. We're talking about\n  reflection,  metaprogramming,  and being able to redefine things on\n  the fly&mdash;all the hallmarks of dynamicity.<\/p>\n\n<p>The current Ruby implementation (MRI) is good for a Unixy language, \n  but it could be better. But when you run into stuff written in C, \n  (altering the behaviour of Arrays,  for instance) the Turtle Factor\n  hits a bit of trouble: <\/p>\n\n<img src='\/static\/i\/shredder.gif' alt='shredder' align='right' \/>\n\n<p>Ideally,  Ruby would give programs access (in Ruby) to every level\n  of the language,  which would be much easier to do (according to Avi)\n  on a Smalltalk VM. One problem I ran into that this would solve is\n  that you can't specify how identity should be calculated when\n  storing things in a Hash. Occasionally I've found myself wanting to\n  override the default behaviour for certain objects that should be\n  treated differently,  which is easy in (say) Lisp.<\/p>\n\n<img src='\/static\/i\/turtles2.jpg' alt='high turtle factor' align='left' \/>\n\n<p>It sounds like the low turtle factor of MRI Ruby is necessary in\n  order to achieve decent performance in the current implementation, \n  but apparently investment in a Smalltalk VM would leave turtle\n  factor much improved. Ruby could join the likes of the classic\n  self-hosting dynamic languages that have had decades to work on this\n  kind of thing. The exciting thing is that Rubinius is already\n  working in this direction; taking cues from the design of Smalltalk\n  if not porting to it outright. Can't wait to see where all this heads.<\/p>\n\n<hr \/>\n\n<p>On an unrelated note,  I've just ported my blog over to a new\n  platform. I'll be posting more on that later,  but in the mean time\n  please excuse the mess; many key features (tags,  feeds,  comment\n  formatting) haven't been implemented yet.<\/p>\n\n<p>Teenage Mutant Ninja Turtles is a trademark of Mirage Studios,  Inc.<\/p>\n"}
