{"timestamp":"Sat Oct 13 00:00:01 -0700 2007","DRAFT":null,"title":"home again","id":9,"content":"<p>\nRubyConf is officially over. It was pretty much amazing. I haven't ever\nbrushed elbows with so much brilliance. My only regret is that I\ndidn't meet more people and introduce myself more. I know it'll only\nbe more difficult next year when there are <a\nhref='http:\/\/blog.curthibbs.us\/articles\/2005\/10\/16\/rubyconf-2005-was-amazing'>over\n500<\/a> attendees. Exponential growth, right? It is quite nice to be\nhome back with my wife, but it was a bummer to have to leave.\n<\/p>\n<p>\nTo cheer me up, it's been raining. Also, the project that <a\nhref='http:\/\/joelmwatson.com\/blog'>Joel<\/a> and I have been working\non, <a\nhref='http:\/\/dev.technomancy.us\/trac.cgi\/wiki\/RPlanet'>RPlanet<\/a>,\nhas been getting some notice, including a <a\nhref='http:\/\/redhanded.hobix.com\/cult\/rubyconf2005keynote.html'>mention\non RedHanded<\/a>. That was pretty exciting for my first personal Ruby\nproject. Joel and I had it nearly equivalent with <a\nhref='http:\/\/planetplanet.org'>the original Python-implemented\nPlanet<\/a> within the first day (minus the ultra-liberality of its\nfeed parser), and by the second day were working on one-upping it with\ncomment feeds. (Actually, Joel was working on that; I was busy with <a\nhref='http:\/\/www.rubys.com'>trademark violations<\/a> in the CSS.)<\/p>\n<p>\nI was just shocked and horrified (ok, I was neither shocked\nnor horrified, merely disappointed) that <a\nhref='http:\/\/planetruby.0x42.net\/'>Planet Ruby<\/a> was running on\nPlanet. Hopefully they'll switch once RPlanet gets a little more\nrobust. At least <a href='http:\/\/planetrubyonrails.com'>Planet\nRails<\/a> is written in Rails, but I was never too impressed with that\nsite. Its subscription to the wiki feed was a real pain, there was\ndowntime all over the place, and it just felt over-engineered. (Why\ndoes an aggregator need a database?) Anyway, I hope to have an RPlanet\nrubyforge page up and make it a gem eventually. So much to do!\n<\/p>"}
