{"timestamp":"Sat Oct 13 00:00:01 -0700 2007","DRAFT":null,"title":"unprecedented cluefulness","id":90,"content":"<p>I came across <a\r\nhref='http:\/\/lenovoblogs.com\/insidethebox\/?p=98'>something\r\ninteresting on a Lenovo blog<\/a> the other day. It seems they're\r\nputting some thought into their OS strategy. You may remember the\r\nbig fuss a while back about Dell offering Ubuntu as an option on\r\ntheir systems. It turns out Lenovo had beaten them to the punch\r\nby at least six months, but Dell was the first American OEM to do\r\nso and the first to actually, well, promote it. But when I bought\r\nmy laptop, Lenovo was the only mainstream OEM that was\r\nforward-thinking enough to even have the option, so supporting\r\nthat was a big factor in <a href='\/74'>my choice to get a\r\nThinkpad<\/a>.<\/p>\r\n\r\n<p>Anyhow now Lenovo are polling the Interwebs to help decide the\r\nshape of their GNU\/Linux strategy. It's no surprise that Ubuntu leads\r\nwith 50% of the vote, but what really struck me was the presence of\r\nthis option in the distro choices:<\/p>\r\n\r\n<blockquote>Anyone that refuses to carry binary-only drivers, so\r\nthat all others will also benefit, as it will require documented\r\nhardware<\/blockquote>\r\n\r\n<p>If you had told me three years ago that a mainstream hardware\r\nvendor would even understand the reasoning behind the FSF's refusal of\r\nbinary drivers, I would have laughed at you. This isn't just an option\r\nthrown out there to placate the rabit GNU fans; the wording shows that\r\nthey clearly understand why binary-only drivers are bad for the\r\ncommunity. Having spent a few hours yesterday wrangling with some <a\r\nhref='http:\/\/nvidia.com'>particularly odious offenders<\/a>, this is\r\nextremely encouraging to read. The binary driver that ATI offers for\r\nthe card in my Thinkpad is absolutely worthless. It drops the refresh\r\nrate to a level approaching 1Hz when I plug in an external display,\r\nmakes hibernation impossible, and doesn't even support standard\r\nfeatures like rotation. It's a total disaster&mdash;even the x.org\r\nVESA drivers outperform it, which is saying a lot. So I can't wait for\r\nLenovo to offer an all-free GNU\/Linux Thinkpad. I'm thinking my next laptop will\r\ndefinitely be an X-series, especially since by then they'll probably\r\nbe offering LED-powered displays and solid-state storage.<\/p>\r\n\r\n<p>The other extremely encouraging bit about this poll is that the\r\noption that excludes non-free drivers is actually in <b>third\r\nplace<\/b> in terms of votes. It's even beating out traditional\r\npowerhouse distros like Fedora, SuSE, and Gentoo. I'm glad to see the\r\nhard-line stance on freedom isn't just something held by crazy bearded GNU\r\nfans.<\/p>\r\n"}
