{"timestamp":"Sat Oct 13 00:00:01 -0700 2007","title":"messages instantly","id":91,"content":"<p>So I've updated my <a href='\/83'>Pidgin<\/a> script fairly\r\n  significantly. The goal here is to be able to be as keyboard-driven\r\n  as possible. It's always bugged me how you need to find the pidgin\r\n  window, scroll down to find the buddy you want, and double-click to\r\n  start talking. So much excess motion. We can improve on this. I've discovered\r\n  a <a href='http:\/\/www.suckless.org\/wiki\/tools\/xlib'>nifty tool\r\n    called dmenu<\/a> that provides super-lightweight \r\n  menus. (If you've\r\n  used <a href='http:\/\/eigenclass.org\/hiki.rb?wmii+ruby'>wmii<\/a> or\r\n  dwm you'll recognize it.) Basically you send it a list of options,\r\n  and it provides you with an autocompleting choice of what has been\r\n  piped in. It emits the one you chose as output, making it very\r\n  convenient for inclusion in scripts.<\/p>\r\n\r\n<p>I've tied this in with Pidgin using some ruby-dbus glue. When you\r\n  want to talk to someone, you invoke the launch script and it will\r\n  give you an autocompleting choice between all your buddies currently\r\n  online. When you choose one, a conversation will be opened with them.\r\n<\/p>\r\n\r\n<p>Invocation is handled by the <tt>pidgin-do.rb<\/tt> script. Bind a\r\n  key to <tt>pidgin-do.rb launch<\/tt> for maximal convenience.<\/p>\r\n\r\n<p>Added bonus: If you don't like keeping your buddy list visible at\r\n  all times, you can use the <tt>list<\/tt> command to get a\r\n  transient notification window with the currently online\r\n  buddies: <tt>pidgin-do.rb list<\/tt><\/p>\r\n\r\n<p>The only issue is that when you launch a conversation and the\r\n  window is not visible, it won't bring it front-and-center. Not sure\r\n  why&mdash;this seems like it's obviously the more useful\r\n  behaviour. A minor point that I intend to address soon. The\r\n  <a href='https:\/\/trac.luon.net\/ruby-dbus\/'>ruby-dbus library<\/a> is\r\n  still needed, but you don't need to use the trunk version any\r\n  more.<\/p>\r\n\r\n<p><a href='http:\/\/dev.technomancy.us\/browser\/dotfiles\/bin\/pidgin-tools.rb'>Grab\r\n  it<\/a> while it's hot.<\/p>\r\n\r\n<p><b>Update:<\/b> created a <a href='http:\/\/dev.technomancy.us\/wiki\/PidginTools'>wiki entry<\/a>.<\/p>"}
