{"timestamp": "Tue Nov 06 17: 31: 25 -0800 2007", "title": "post-rubyconf07", "id": 96, "content": "<p>Well,  I'm back in Seattle after a fun but grueling weekend in\n  Charlotte,  North Carolina\n  for <a href='http: //rubyconf.org'>RubyConf</a> 2007. This year's was\n  as good as ever. Even though the number of attendees was about\n  double last year's there still seemed to be that tight-knit feel\n  that distinguishes it from RailsConf. The multi-track format forced\n  a few hard decisions,  but overall it was a definite win.</p>\n\n<a href='http: //www.flickr.com/photos/technomancy/1884018556/'\ntitle='Photo\nSharing'><img src='http: //farm3.static.flickr.com/2370/1884018556_931c01adc9_m.jpg'\nwidth='180' height='240' alt='Cartoon Phil' align='right' /></a>\n\n<p>Of course,  this year was very different for me since I gave a talk\n  for the first time. The organizers had anticipated the room being\n  broken up into three smaller rooms for the multi-track portions,  but\n  there turned out to be four rooms. So one of the rooms was\n  double-sized and could fit half the total conference attendees. This\n  happened to be the room I was talking in,  which was a bit\n  intimidating at first,  but once I got rolling my practice paid off\n  and it went pretty smoothly.</p>\n\n<p>The main downside was I found it hard to relax before my talk as I\n  was constantly trying to find time to go over the slides/code and\n  practice more. I foolishly chose a topic that needed a good deal of\n  effort put into coding as well as just the talk,  a path that I\n  wouldn't recommend for other first-time presenters. I also took\n  fewer <a href='http: //www.flickr.com/photos/technomancy/tags/rubyconf07/'>photos</a>\n  on the trip than I have on any other in the past,  which was quite a\n  shame. And then there's that feeling you always get at events like\n  this where there's just so much going on,  even apart from the\n  talks. It's hard to know in the evenings how to spend your time; if\n  you leave to use the restroom you're likely to miss something\n  great. It's a wonder anyone slept.</p>\n\n<p>The primary theme of the weekend seemed to be upcoming new Ruby\n  implementations. Koichi's progress on Ruby 1.9 looked promising, \n  although there was less time spent covering it than usual. I'd\n  imagine that's because it's fairly well-understood by most and the\n  initial release is imminent. The highlight of the conference for me\n  was Evan's <a href='http: //rubini.us'>Rubinius</a> talk,  in which he\n  explained the motivation and methods of his underdog\n  implementation. Increasing the <a href='http: //technomancy.us/81/'>turtle-factor</a> of Ruby\n  is a big deal&mdash;for the first time committing to the core seems\n  really accessible to your regular (skilled) Rubyists. It's really\n  amazing that it's able to compete with the big corporate-funded\n  implementations like JRuby and IronRuby. Part of that comes from\n  <a href='http: //www.engineyard.com'>EngineYard</a>'s amazing\n  generosity in sponsoring the project,  (which I imagine we'll hear\n  more about soon) but I imagine part of that is just building off the\n  work of really smart Smalltalk folks and harnessing the community\n  via the power of the open commit bit.</p>\n\n<p>Speaking of the open commit bit,  distributed version control seemed\n  to be an ever-present undertone. What with the oversaturated wifi\n  network that you always see at conferences,  it was really handy to\n  be able to clone a local copy of the rubinius git repository in a\n  quick minute without hitting the uplink. (Compare this to\n  downloading a tarball of a Ruby 1.9 SVN checkout,  which took over\n  two hours over the Internet.)  There were a few Mercurial vs Git\n  wars on #rubyconf,  but it's exciting to see these ideas get more\n  traction. (Check\n  out <a href='http: //topfunky.com'>Geoff</a>'s <a href='http: //peepcode.com/products/git'>Peepcode</a>\n  on Git if you're confused and looking to learn; it's quite\n  helpful.)</p>\n\n<p>The other theme I saw surfacing repeatedly was that of\n  introspection. Lots of speakers seemed to be talking about ways in\n  which to improve your own habits as a developer by\n  self-examination. As a matter of fact,  this included my own talk. In\n  'Tightening the Feedback Loop',  I talked about ways in which you can\n  improve development effectiveness by decreasing the interval between\n  the point in which relevant changes are made to your code and the\n  time you find out about them. Basically it covered what metrics you\n  should care about,  how you should set up tools to measure them in an\n  automated fashion,  and the times and ways it would be best to bring\n  those measurements to your attention. It ended with a demo\n  of <a href='http: //augment.rubyforge.org'>augment</a>,  a project\n  I'm working on to make it easier to apply these ideas of feedback.</p>\n\n<p>Augment is a framework for gathering metadata from code and displaying\n  it. The idea is that it has these backends,  each which handles\n  measuring a different metric,  and it has some idea of when it's\n  appropriate to do the measuring. There's then a set of frontends for\n  various editing environments that bring the relevant information to\n  your attention. In the future it will also record historical\n  statistics for your project. Testing is the only backend currently\n  fully implemented,  but rspec,  but flog,  rcov,  performance tests,  and\n  other backends are planned.</p>\n\n<p>I've got\n  the <a href='http: //technomancy.us/static/feedback_slides.tar.gz'>slides\n  up</a> for interested parties. I imagine you'd probably rather\n  wait for the video to get posted though. <a href='http: //blade.nagaokaut.ac.jp/cgi-bin/scat.rb/ruby/ruby-talk/266002'>Confreaks</a>\n  did an excellent job of recording all the sessions,  and it looks\n  like they're going to be posted with Creative-Commons licensing.</p>\n\n<p>My talk seemed to be well-received; the double-sized room was\n  almost full. I had a number of folk afterwards express enthusiasm\n  about the ideas I had put forth,  and a few wanted to contribute code\n  as well; all very encouraging. If you're interested in these ideas, \n  please <a href='http: //rubyforge.org/mail/?group_id=4606'>join the\n  mailing list</a> to discuss.</p>\n\n<p>Also had some cool Emacs happenings at the conference,  but this\n  post is ridiculously long,  so I'll save it for another one coming\n  soon.</p>\n"}
