{"timestamp":"Tue Nov 06 22:33:17 -0800 2007","title":"strike force: assemble!","id":97,"content":"<p>Another highlight of the <a href='http:\/\/technomancy.us\/96'>time I\r\n  spent at RubyConf 07<\/a> was hanging out with the Ruby Emacs\r\n  crew. Interestingly enough, this included Matz himself, who regaled\r\n  us with a great historical anecdote. When he was first starting out\r\n  writing Ruby, he was coding the Emacs <tt>ruby-mode.el<\/tt> for it\r\n  at the same time. He expressed some frustration with modes for other\r\n  languages like Python and Pascal in which the editor could not look\r\n  at a line of code and figure out where it should be indented to, so\r\n  he resolved that Ruby as a language should not fall into that\r\n  particular trap. With that in mind he chose the end keyword as a\r\n  block delimiter so that it would be easier to write an Emacs mode\r\n  for.<\/p>\r\n\r\n<p>All that to say, Emacs and Ruby have a history that's been\r\n  interconnected since the beginning. Recently I've noticed it seems\r\n  that things have fallen into a state of relative disrepair. At the\r\n  very least the situation could use some improvement. So the night\r\n  after my talk I gathered anyone who was interested in Emacs\/Ruby\r\n  integration for a discussion. I was pleasantly surprised by the size\r\n  of the crowd that gathered&mdash;for a while we even outnumbered\r\n  the <a href='http:\/\/headius.blogspot.com\/2007\/11\/is-werewolf-killing-conference-hackfest.html'>Werewolf<\/a>\r\n  players. We started to put together a plan for how the state of our\r\n  tools could be improved.<\/p>\r\n\r\n<p>First off was the simple idea that we should actually use the\r\n  mailing list that's existed for so long to\r\n  communicate. The <a href='http:\/\/tech.groups.yahoo.com\/group\/ruby_emacs_dev\/'>emacs-ruby-dev<\/a>\r\n  mailing list sees a short flurry of traffic after every Rubyconf,\r\n  but it's silent most of the year. But we've never gotten quite this\r\n  many people gathered in the interest of working together, so I think\r\n  this could very well go somewhere. I like the idea of forming a\r\n  focused 'Strike Force' for getting this done. Publicising a strong\r\n  group identity creates strong motivation to see the project succeed,\r\n  as evidenced by the\r\n  <a href='http:\/\/rubyhitsquad.com'>Ruby Hit Squad<\/a>. The other big\r\n  idea was to coordinate using the EmacsWiki. For a while we had a\r\n  Basecamp project set up, but it quickly died. I think the lower\r\n  barrier-to-entry of a wiki is worth the chaos that's often\r\n  associated with it. It's especially true in this case because the\r\n  EmacsWiki is already a prominent community establishment.<\/p>\r\n\r\n<p>As for the actual tasks, a number of things were suggested:<\/p>\r\n\r\n<ul>\r\n  <li><b>core ruby-mode.el and friends<\/b> - There's a certain set of\r\n    elisp that actually comes with the Ruby distribution. It's quite\r\n    helpful, but there are still a few bugs that you come across in\r\n    day-to-day use, especially with <tt>ruby-electric<\/tt> mode. This\r\n    could use some work and would probably be the best starting\r\n    place since improvement here helps everyone.<\/li>\r\n\r\n  <li><b>rails.el<\/b> - I was added to the developer list\r\n    for <a href='http:\/\/rails-emacs.rubyforge.org'>rails.el<\/a> a few\r\n    months ago. Unfortunately soon after I was put on a project that\r\n    involved little-to-no day-to-day rails work, so my involvement\r\n    (though not my motivation) in moving this forward has been\r\n    slight. I'd like to open this up to the Strike Force with the\r\n    understanding that Emacs conventions should be honored and\r\n    <a href='http:\/\/emacs-rails.rubyforge.org\/svn\/trunk\/rails-cmd-proxy.el'>complexity<\/a>\r\n    eschewed where possible. This would probably be handled by me\r\n    reviewing patches as they come in, especially as things get\r\n    started. I'm pretty opinionated about what goes into\r\n    my <tt>~\/.emacs.d<\/tt>.<\/li>\r\n\r\n  <li><b>gem distribution<\/b> - It would be great to package up all\r\n    the awesome ruby-related elisp for one easy installation. Building\r\n    a gem for this would be the natural choice since Emacs-based\r\n    packaging hasn't really gotten much traction and everyone who'd be\r\n    interested in this would already have rubygems installed.<\/li>\r\n\r\n  <li><b>rhtml-mode<\/b> - The focus on rhtml-mode has mostly been on\r\n    syntax highlighting so far. It doesn't even have that perfect yet;\r\n    embedded templating languages are notoriously difficult to parse\r\n    in font-lock, but it wouldn't hurt to expand its focus to other\r\n    functionality. Perhaps deriving it from nxhtml-mode would be good\r\n    as this is (a) <a href='http:\/\/pluskid.lifegoo.com\/?p=59'>most\r\n    excellent<\/a> and (b) making its way into the core Emacs\r\n    distribution soon IIRC.<\/li>\r\n\r\n  <li><b>misc fixes<\/b> -\r\n    The <a href='http:\/\/rubyforge.org\/projects\/ri-emacs\/'>ri-emacs\r\n    tool<\/a> is invaluable, but the delay upon the first invocation\r\n    often discourages me from using it as often as I should. This\r\n    could probably be fixed. Some have expressed a desire to fix up\r\n    the <a href='http:\/\/code.google.com\/p\/smart-snippet\/'>snippet<\/a> library as well. Getting these\r\n    patched up, distributing them together, and submitting the patches\r\n    back upstream would be great.<\/li>\r\n  \r\n  <li><b>augment integration<\/b> - As\r\n    per <a href='http:\/\/technomancy.us\/96'>my last post<\/a>, I've been\r\n    working on a generalized system to get feedback from your code and\r\n    display it back to the user in the editor. Naturally the first\r\n    editor support I worked on was for Emacs. It's a bit buggy, so\r\n    improvement and new functionality is a must.<\/li>\r\n\r\n  <li><b>elunit<\/b> - What, you didn't think we were going to be\r\n    writing all this code without tests did you? Tests are\r\n    discouragingly rare in Emacs Lisp Land, but don't let that stop\r\n    us. We're going to have to\r\n    make <a href='http:\/\/www.emacswiki.org\/cgi-bin\/wiki\/ElUnit'>elunit<\/a>\r\n    rock so hard that elisp authors won't be able to help but use\r\n    it. Am I making myself clear? <\/li>\r\n\r\n  <li><b>documentation<\/b> - A lot of folks who are new to Ruby get\r\n    intimidated by the initial face that Emacs presents new\r\n    users. Writing up tutorials and perhaps even putting together\r\n    screencasts would go a long way towards easing this pain. Emacs is\r\n    the original environment for writing Ruby, but new users need a\r\n    gentle introduction.<\/li>\r\n<\/ul>\r\n\r\n<p>Anyway, that's quite a lot of work. We talked about how to best get\r\n  everyone involved, and it looks like tracking the project with git\r\n  and using a rubinius-esque open commit bit would encourage\r\n  participation. If this sounds like something you'd like to be\r\n  involved in, please get on\r\n  the <a href='http:\/\/tech.groups.yahoo.com\/group\/ruby_emacs_dev\/'>mailing\r\n  list<\/a> and make yourself heard! Even if you don't code much elisp,\r\n  there's still documentation, feature suggestions, testing, and more\r\n  that you can help with. Watch this space as I'm sure to report on\r\n  the project as it progresses.<\/p>"}
